#include <sys/develop.h>
#include <db/debug.h>

typedef struct dbUnknownThing {
#ifdef PORT
    u8 dbUnknownThing_0x0[0x3C - 0x0];
    s16 dbUnknownThing_0x3C;
    s16 dbUnknownThing_0x3E;
    u8 dbUnknownThing_0x40[0x44 - 0x40];
    s16 dbUnknownThing_0x44;
    s16 dbUnknownThing_0x46;
#else
	u8 dbUnknownThing_0x0[0x3C - 0x0];
	s16 dbUnknownThing_0x3C;
	s16 dbUnknownThing_0x3E;
	u8 dbUnknownThing_0x40[0x44 - 0x40];
	s16 dbUnknownThing_0x44;
	s16 dbUnknownThing_0x46;
#endif
} dbUnknownThing;

typedef struct DbThingAtArg0_unk34 {
#ifdef PORT
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ dbFunction *fn;  
    /* 0x0C */ s32 unkC;
    // ...
#else
	/* 0x00 */ s32 unk0;
	/* 0x04 */ s32 unk4;
	/* 0x08 */ dbFunction *fn;  
	/* 0x0C */ s32 unkC;
	// ...
#endif
} DbThingAtArg0_unk34;

#ifdef PORT
extern dbUnknownLinkStruct D_ovl8_8038D0D0;
extern dbFunction D_ovl8_8038D218;
extern dbUnknownLink D_ovl8_8038D370;
extern dbUnknownLinkStruct D_ovl8_8038D3A0;
extern dbFunction D_ovl8_8038D4C0;
extern dbUnknownLink D_ovl8_8038D618;
extern SYColorRGBA D_ovl8_8038D640; // = { 0xFF, 0x00, 0x00, 0xFF };
#else


extern sb32 func_ovl8_803718FC();
extern sb32 func_ovl8_80371930();
extern sb32 func_ovl8_80371960();
extern sb32 func_ovl8_80371968();
extern sb32 func_ovl8_80371970();
extern sb32 func_ovl8_80371978();
extern sb32 func_ovl8_80371980();
extern sb32 func_ovl8_803719A4();
extern sb32 func_ovl8_803719C8();
extern sb32 func_ovl8_80371A2C();
extern sb32 func_ovl8_80371AC4();
extern sb32 func_ovl8_80371ACC();
extern sb32 func_ovl8_80371AD8();
extern sb32 func_ovl8_80371B34();
extern sb32 func_ovl8_80371B98();
extern sb32 func_ovl8_80371BCC();
extern sb32 func_ovl8_80371C2C();
extern sb32 func_ovl8_80371C50();
